w11d4-jbuilder/TeaTime/app/controllers/api/teas_controller.rb

SELECT "teas".* FROM "teas" ORDER BY "teas"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def index
        @teas = Tea.all

SELECT "teas".* FROM "teas" WHERE "teas"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def show
        @tea = Tea.find_by(id: params[:id])

INSERT INTO "teas" ("flavor", "price", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["flavor", "rose"], ["price", 40.0], ["description", "SUPER RARE!!!SUPER RARE"], ["created_at", "2023-07-13 15:12:22.966979"], ["updated_at", "2023-07-13 15:12:22.966979"]]
---
    def create
        @tea ||= Tea.new(tea_params)

        if @tea.save