w12d2-fullstack-auth/demo/TeaTime/app/controllers/api/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at", "session_token", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "peter"], ["created_at", "2023-07-18 15:15:41.149418"], ["updated_at", "2023-07-18 15:15:41.149418"], ["session_token", "[FILTERED]"], ["password_digest", "[FILTERED]"]]